# -----------------------------------------------------------
# Файл для объявления функций которые используются в разных системах
#
#
# -----------------------------------------------------------

import os

# ------------------------------------------------------------
# очитска экрана в системах
# ------------------------------------------------------------

# Очиста монитора в системах

def clean_monitor_system():
    if os.name == "nt":
        print(os.system(" cls "))
    elif os.name == "posix":
        print(os.system(" clear "))
    

# ------------------------------------------------------------
# Вызов команды ping 
# ------------------------------------------------------------

# Вызов команды ping  в Windows системах

def nt_ping(num, hostname):
    return os.system ("ping -n " + num + " " + hostname)

# Вызов команды ping  в Linux системах

def posix_ping(num, hostname):
     return os.system ("ping -c " + num + " " + hostname)