# -----------------------------------------------------------
# Файл для объявления функций которые используются в разных системах
#
#
# -----------------------------------------------------------

import os

# ------------------------------------------------------------
# очитска экрана в системах
# ------------------------------------------------------------

# Очиста монитора в windows системах

def nt_clean_monitor(): 
    print(os.system("cls"))

# Очиста монитора в Linux системах

def posix_clean_monitor():
    print(os.system("clear"))

# ------------------------------------------------------------
# Вызов команды ping 
# ------------------------------------------------------------

# Вызов команды ping  в Windows системах

def nt_ping(num, hostname):
    return os.system ("ping -n " + num + " " + hostname)

# Вызов команды ping  в Linux системах

def posix_ping(num, hostname):
     return os.system ("ping -c " + num + " " + hostname)